var contents = [
    {
      "topics": [
        "System-level Floorplan Optimization of Network-on-chip",
        "Processor-memory Communication Network for Chip Multiprocessors",
        "High-speed Inter-chip/board Interconnects and Interfaces",
        "Efficient Artificial Intelligence on Edge Devices",
        "Low-Power Design of Neuromorphic Chip for Spiking Neural Network"
      ]  
    },
    {
      "type": "Journal",
      "title": "Reduce Loss and Crosstalk in Integrated Silicon-Photonic Multistage Switching Fabrics through Multi-Chip Partition",
      "author": "Zhehui Wang, Zhifei Wang, Jiang Xu, <I> et.al. </I>;",
      "source": "IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD)",
      "abstract": "With the increasing popularity of data-intensive applications in data centers, the switching fabric in the inter-node network becomes significant. Silicon-photonic switching fabrics have a bright future in data centers, which offer high bandwidth, high energy efficiency, and low latency. However, integrating a high radix multi-stage switching fabric in a single chip faces challenges. A large number of waveguide crossings on the silicon photonic die causes massive power loss and introduces a tremendous amount of crosstalk noise. In this paper, we propose a chip partition optimization platform (POP), which can decrease the number of waveguide crossings and shorten the on-chip traversal distance of optical signals. Our algorithms can effectively reduce the power loss and crosstalk noise in silicon-photonic multistage switching fabrics, and help to improve the signal integrity. For example, compared with the common design, POP can achieve 33 dB improvement on average power loss, 42 dB improvement on worst-case power loss, and 39 dB improvement on worst-case signal to noise ratio, in a 1024×1024 butterfly based silicon-photonic switching fabric.",
      "bibtex": "In publication..."
    },
    {
      "type": "Journal",
      "title": "CAMON: Low-Cost Silicon Photonic Chiplet for Manycore Processors",
      "author": "Zhehui Wang, Zhifei Wang, Jiang Xu, <I>et.al.</I>;",
      "source": "IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD)",
      "abstract": "While many new applications prefer manycore processor with a large number of cores, the exploding communications among multiple cores, caches, and off-chip memories is posing a fundamental challenge on manycore designs. Silicon photonics based interconnection network promises high bandwidth, low latency, and high energy efficiency, and can potentially meet the communication requirements of manycore processors. In this work, we propose CAMON, a small low-cost silicon photonic chiplet integrated into the manycore processor package. CAMON chiplet can effectively alleviate the communication bottlenecks of manycore processors and improve the energy efficiency of data movement, especially for large-scale systems. We develop a distributed arbitration system, a low-power low-latency optical interface, and an off-chip laser preactivation mechanism for CAMON. Experiment results show that compared with the electrical network, CAMON can improve the full-system performance per energy by 4.6X, speed up the manycore processor by 2.7X, and save the area of the processor die by 3%, in a 512-core system.",
      "bibtex": "In publication..."
    }, 
    {
      "type": "Journal",
      "title": "A Holistic Modeling and Analysis of Optical-Electrical Interfaces for Inter/Intra-chip Interconnects",
      "author": "Zhehui Wang, Jiang Xu, <I> et.al. </I>;",
      "source": "IEEE Transactions on Very Large Scale Integration Systems (TVLSI), vol. 24, no. 7, pp. 2462-2474, July 2016.",
      "abstract": "With the fast development of processor chips, power-efficient, high-bandwidth, and low-latency interchip interconnects become more and more important. Studies show that the bandwidth of traditional parallel interconnects with low I/O clock frequencies will become bottlenecks in the near future. To solve this problem, two types of high-bandwidth interchip interconnects are developed. Low-swing differential electrical interconnects have widely been used in high-speed I/O designs. On the other hand, optical interconnects promise high bandwidth, low latency, and could improve the chip pin performance for manycore processors. They are becoming potential alternatives for electrical interconnects. This paper systematically models these two types of interconnects in terms of crosstalk noises, attenuation, and receiver sensitivities. Based on the proposed models, we developed optical and electrical interfaces and links (OEIL) and an analysis tool for OEIL. The OEIL can be used to analyze the energy consumption, bandwidth density, and latency of interconnects. Analytical models are verified by the results of published experiments. It shows that the optical interconnects have much higher bandwidth densities than the electrical interconnects. With this feature, the optical interconnects can significantly reduce I/O pin count compared with the electrical interconnects. For example, they can save at least 92% signal pins when connecting chips more than 25 cm (10 in) apart. The energy consumption of optical interconnects is comparable with that of electrical interconnects, and the latency of polymer waveguide-based optical interconnects is 18% less than that of electrical interconnect.",
      "bibtex": "@ARTICLE{7389433,\nauthor={Z. Wang and J. Xu and others},\njournal={IEEE Transactions on Very Large Scale Integration (VLSI) Systems}, \ntitle={A Holistic Modeling and Analysis of Optical–Electrical Interfaces for Inter/Intra-chip Interconnects},\nyear={2016},\nvolume={24},\nnumber={7},\npages={2462-2474},}"
    },   
    {
      "type": "Journal",
      "title": "Improve Chip Pin Performance Using Optical Interconnects",
      "author": "Zhehui Wang, Jiang Xu, <I> et.al. </I>;",
      "source": "IEEE Transactions on Very Large Scale Integration Systems (TVLSI), vol. 24, no. 4, pp. 1574-1587, April 2016.",
      "abstract": "With the fast development of inter/intra-chip optical interconnects, the gap between the data rates of electrical interconnects and optical interconnects is continuously increasing. Electrical-optical (E-O) interfaces and optical-electrical (O-E) interfaces are a pair of components that convert data between parallel electrical interconnects and serial optical interconnects. This paper holistically models and analyzes E-O and O-E interfaces in terms of energy consumption, area, and latency. Traditional interfaces, where data are converted between parallel and serial ports by serializers and deserializers (SerDes), are studied. A new type of E-O and O-E interface, which serializes and deserializes data by optical weaving technologies, are proposed alongside. Traditional interfaces will become a bottleneck for the further development of optical interconnects in the near future because of the high energy consumption and large area of SerDes necessitating new technologies. Our analysis shows that optical weaving interfaces have a better overall performance than traditional interfaces. For example, if there are 64 parallel electrical interconnects and four optical wavelengths, optical weaving interfaces can achieve a 81.6% improvement in energy consumption and a 40.8% improvement in area, compared with traditional interfaces.",
      "bibtex": "@ARTICLE{7154512,\nauthor={Z. Wang and J. Xu and others},\njournal={IEEE Transactions on Very Large Scale Integration (VLSI) Systems},\ntitle={Improve Chip Pin Performance Using Optical Interconnects}, \nyear={2016},\nvolume={24},\nnumber={4},\npages={1574-1587},}"
    },  
    {
      "type": "Journal",
      "title": "Floorplan Optimization of Fat-Tree Based Networks-on-Chip for Chip Multiprocessors",
      "author": "Zhehui Wang, Jiang Xu, <I> et.al. </I>;",
      "source": "IEEE Transactions on Computers (TC), vol. 63, no. 6, pp. 1446-1459, June 2014.",
      "abstract": "Chip multiprocessor (CMP) is becoming increasingly popular in the processor industry. Efficient network-on-chip (NoC) that has similar performance to the processor cores is important in CMP design. Fat-tree-based on-chip network has many advantages over traditional mesh or torus-based networks in terms of throughput, power efficiency, and latency. It has a bright future in the development of CMP. However, the floorplan design of the fat-tree-based NoC is very challenging because of the complexity of topology. There are a large number of crossings and long interconnects, which cause severe performance degradation in the network. In electronic NoCs, the parasitic capacitance and inductance will be significant. In optical ones, large crosstalk noise and power loss will be introduced. The novel contribution of this paper is to propose a method to optimize the fat-tree floorplan, which can effectively reduce the number of crossings and minimize the interconnect length. Two types of floorplans are proposed, which could be applied to fat-tree-based networks of arbitrary size. Compared with the traditional one, our floorplans could reduce more than 87% of the crossings. Since the traversal distance for signals is related to the aspect ratio of the processor cores, we also present a method to calculate the optimum aspect ratio of the processor cores to minimize the traversal distance.",
      "bibtex": "@ARTICLE{6392822,\nauthor={Z. Wang and J. Xu and others},\njournal={IEEE Transactions on Computers}, \ntitle={Floorplan Optimization of Fat-Tree-Based Networks-on-Chip for Chip Multiprocessors}, \nyear={2014},\nvolume={63},\nnumber={6},\npages={1446-1459},}"
    },  
    {
      "type": "Conference",
      "title": "NCPower: Power Modelling for NVM-based Neuromorphic Chip",
      "author": "Zhehui Wang, Huaipeng Zhang, Tao Luo, Weng-Fai Wong, <I> et.al. </I>;",
      "source": "International Conference on Neuromorphic Systems (ICONS), USA, July 2020.",
      "abstract": "Spiking neural networks (SNN) on non-volatile nemory (NVM) based neuromorphic computing (NC) chips have been regarded as a promising solution in power constrained scenarios, such as Internet of Things (IoT), due to its low energy consumption. The high power efficiency of NC is due to various aspects including the non-von Neumann architecture of NC chip, low power NVM, and the event-driven computation of SNN etc., and introduces a large space for low power design exploration. Therefore, a comprehensive quantitative study of the power modelling for such neuromorphic computing system is important for low power design. In this work, we propose NCPower, an energy consumption estimator for NVM-based neuromorphic chip. We systemically developed analytical models for each module in the chip based on physical laws. We verified NCPower by comparing the analytical results with measurement results from different NVM based neuromorphic chips. The analytical result from NCPower could well match experiment results. We integrated NCPower in a SNN simulator, and analyzed the accuracy and energy consumption of both the traditional multi-spike based SNN and the novel single-spike based SNN. It shows that the single-spike model has 7X energy efficiency over the multi-spike model, while maintaining a similar accuracy under the CIFAR10 dataset. The estimator also showed that the best resistance range for the NVM resistors is 10 kOmega-100 kOmega for the multi-spike model.",
      "bibtex": "In publication..."
    }, 
    {
      "type": "Conference",
      "title": "MOCA: an Inter/Intra-Chip Optical Network for Memory",
      "author": "Zhehui Wang, Zhengbin Pang, Peng Yang, Jiang Xu, <I> et.al. </I>;",
      "source": "Design Automation Conference (DAC), USA, June 2017.",
      "abstract": "The memory wall problem is due to the imbalanced developments and separation of processors and memories. It is becoming acute as more and more processor cores are integrated into a single chip and demand higher memory bandwidth through limited chip pins. Optical memory interconnection network (OMIN) promises high bandwidth, bandwidth density, and energy efficiency, and can potentially alleviate the memory wall problem. In this paper, we propose an optical inter/intra-chip processor-memory communication architecture, called MOCA. Experimental results and analysis show that MOCA can significantly improve system performance and energy efficiency. For example, comparing to Hybrid Memory Cube (HMC), MOCA can speedup application execution time by 2.6×, reduce communication latency by 75%, and improve energy efficiency by 3.4× for 256-core processors in 7 nm technology.",
      "bibtex": "@INPROCEEDINGS{8060369,\nauthor={Z. Wang and  Z. Pang and  P. Yang and  J. Xu and others},\nbooktitle={2017 54th ACM/EDAC/IEEE Design Automation Conference (DAC)},\ntitle={MOCA: An inter/intra-chip optical network for memory},\nyear={2017},\nvolume={},\nnumber={}, \npages={1-6},}"
    }, 
    {
      "type": "Conference",
      "title": "Alleviate Chip I/O Pin Constraints for Multicore Processors Through Optical Interconnects",
      "author": "Zhehui Wang, Jiang Xu, <I> et.al. </I>;",
      "source": "Asia and South Pacific Design Automation Conference (ASP-DAC), Japan, January 2015.",
      "abstract": "Chip I/O pins are an increasingly limited resource and significantly affect the performance, power and cost of multicore processors. Optical interconnects promise low power and high bandwidth, and are potential alternatives to electrical interconnects. This work systematically developed a set of analytical models for electrical and optical interconnects to study their structures, receiver sensitivities, crosstalk noises, and attenuations. We verified the models by published implementation results. The analytical models quantitatively identified the advantages of optical interconnects in terms of bandwidth, energy consumption, and transmission distance. We showed that optical interconnects can significantly reduce chip pin counts. For example, compared to electrical interconnects, optical interconnects can save at least 92% signal pins when connecting chips more than 25 cm (10 inches) apart.",
      "bibtex": "@INPROCEEDINGS{7059107,\nauthor={Z. Wang and J. Xu and others},\nbooktitle={The 20th Asia and South Pacific Design Automation Conference},\ntitle={Alleviate chip I/O pin constraints for multicore processors through optical interconnects},\nyear={2015},\nvolume={},\nnumber={},\npages={791-796},}"
    },
    {
      "type": "Conference",
      "title": "A Novel Low-Waveguide-Crossing Floorplan for Fat Tree Based Optical Networks-on-Chip",
      "author": "Zhehui Wang, Jiang Xu, <I> et.al. </I>;",
      "source": "IEEE Optical Interconnects Conference, USA, May 2012.",
      "abstract": "Optical network-on-chip (ONoC) can be used as the communication backbone for high performance chip multiprocessors (CMPs). Fat tree based ONoC shows high throughput, small delay and low power consumption. However, the traditional floorplan design of fat tree based ONoC has a large number of waveguide crossings because of the fat tree topology. In this paper, we present an optimized floorplan with the least number of waveguide crossings that has been reported. The average number of waveguide crossings per optical path in the optimized floorplan is 87% less than that in traditional floorplan for a 64-core CMP. We also find the optimal aspect ratio of cores to minimize the end-to-end delay. These work could help to ease the physical implementation of fat tree based ONoC for CMP.",
      "bibtex": "@INPROCEEDINGS{6224427,\nauthor={Z. Wang and J. Xu and others},\nbooktitle={2012 Optical Interconnects Conference}, \ntitle={A novel low-waveguide-crossing floorplan for fat tree based optical networks-on-chip}, \nyear={2012},\nvolume={},\nnumber={},\npages={100-101},}"
    },    
    {
      "type": "Book",
      "title": "Silicon Photonics Enabled Rack-Scale Many-Core Systems",
      "author": "Peng Yang, Zhehui Wang, Zhifei Wang, Xuanqi Chen, Luan H. Duong, Jiang Xu;",
      "source": "Many-Core Computing: Hardware and Software, pp. 449-470, June 2019.",
      "abstract": "The increasingly higher demands on computing power from scientific computations, big data processing and deep learning are pushing the emergence of exascale computing systems. Tens of thousands of or even more manycore nodes are connected to build such systems. It imposes huge performance and power challenges on different aspects of the systems. As a basic block in high-performance computing systems, modularized rack will play a significant role in addressing these challenges. In this chapter, we introduce rack-scale optical networks (RSON), a silicon photonics enabled inter/intra-chip network for rack-scale many-core systems. RSON leverages the fact that most traffic is within rack and the high bandwidth and low-latency rack-scale optical network can improve both performance and energy efficiency. We codesign the intra-chip and inter-chip optical networks together with optical internode interface to provide balanced data access to both local memory and remote note's memory, making the nodes within rack cooperate effectively. The evaluations show that RSON can improve the overall performance and energy efficiency dramatically. Specifically, RSON can deliver as much as 5.4x more performance under the same energy consumption compared to traditional InfiniBand connected rack.",
      "bibtex": "@CHAPTER{iet:/content/books/10.1049/pbpc022e_ch18,\nauthor={Peng Yang and Zhehui Wang and Zhifei Wang and Xuanqi Chen and Luan H. Duong and Jiang Xu},\ntitle={Silicon photonics enabled rack-scale many-core systems},\nbooktitle=Many-Core Computing: Hardware and Software,\npublisher={Institution of Engineering and Technology},\nyear={2019},\npages={449-470},\nseries={Computing},\ndoi={10.1049/PBPC022E_ch18},\nurl={https://digital-library.theiet.org/content/books/10.1049/pbpc022e_ch18},}"
    }, 
    {
      "type": "Book",
      "title": "A Fast Joint Application-Architecture Exploration Platform for Heterogeneous Systems",
      "author": "Rafael K. Vivas Maeda, Peng Yang, Haoran Li, Zhongyuan Tian, Zhehui Wang, Zhifei Wang, Xuanqi Chen, Jun Feng, Jiang Xu;",
      "source": "Embedded, Cyber-Physical, and IoT Systems, pp. 203-232, Jan 2020.",
      "abstract": "Computing systems become increasingly heterogeneous by adopting domain-specific accelerators. While heterogeneity provides better trade-offs among performance, energy efficiency, and cost, it adds new dimensions to the already huge design space. Existing design exploration tools rely on time-based analysis. Simulating a heterogeneous computing system using detailed cycle-accurate simulations could last for months, if not years. In this work, we introduce JADE, a joint application-architecture exploration platform for heterogeneous computing systems. JADE targets design space explorations with overall system characteristics such as average performance and energy efficiency instead of detailed cycle-by-cycle behaviors. It uses statistical application models and cycle-accurate architecture models. JADE can speed up design explorations by several orders of magnitude. The statistical application behaviors make it easy to explore heterogeneous systems. JADE can simulate complete systems including processing units, memory hierarchy, interconnect, and peripherals.",
      "bibtex": "@Inbook{VivasMaeda2020,\nauthor={Vivas Maeda, Rafael K. and Yang, Peng and Li, Haoran and Tian, Zhongyuan and Wang, Zhehui and Wang, Zhifei and Chen, Xuanqi and Feng, Jun and Xu, Jiang},\neditor={Bhattacharyya, Shuvra S. and Potkonjak, Miodrag and Velipasalar, Senem},\ntitle={A Fast Joint Application-Architecture Exploration Platform for Heterogeneous Systems},\nbookTitle={Embedded, Cyber-Physical, and IoT Systems: Essays Dedicated to Marilyn Wolf on the Occasion of Her 60th Birthday},\nyear={2020},\npublisher={Springer International Publishing},\naddress={Cham},\npages={203--232},\nisbn={978-3-030-16949-7},\ndoi={10.1007/978-3-030-16949-7_9},\nurl={https://doi.org/10.1007/978-3-030-16949-7_9},}"
    },  
    {
      "type": "Journal",
      "title": "Multidomain Inter/Intrachip Silicon Photonic Networks for Energy-Efficient Rack-Scale Computing Systems",
      "author": "Peng Yang, Zhehui Wang, Zhifei Wang, Jiang Xu, <I>et.al.</I>;",
      "source": "IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), vol. 39, no. 3, pp. 626-639, March 2020.",
      "abstract": "Rack-scale computing systems are promising to undertake the emerging large-scale applications by distributing massive tasks to processing cores. The communication and coordination efficiency of these tasks and resources directly affect the system performance and energy consumption. Silicon photonic interconnects are expected to address the communication and system power consumption challenges imposed on rack-scale systems. However, the control for optical interconnects can cause server performance degradation if not properly designed, especially for the complicated and time-consuming multidomain networks. In this paper, we study the optical interconnects for rack-scale computing systems and propose a new communication flow and control scheme for the efficient coordination of distributed resources. Particularly, we first propose a forward propagation strategy that parallels the path reservation process with the distributed tasks connection setup. Second, we develop a pre-emptive chain feedback (PCF) scheme to optimize multidomain path reservation. The PCF scheme pre-emptively allocates network resources with the help of multicell reservation window and quickly releases resources with a feedback mechanism. This solution increases the network resources utilization and task coordination efficiency while minimizing path reservation overheads. Comparing to the baseline InfiniBand network fabric and handshake scheme, PCF can improve network throughput greatly under uniform and hotspot traffic patterns. Realistic benchmark results show that the PCF scheme on average reduces 52% and 60% energy consumption per unit system performance than InfiniBand and the handshake scheme for a 256-node rack system.",
      "bibtex": "@ARTICLE{8624402,\nauthor={P. Yang and Z. Wang and Z. Wang and J. Xu and others},\njournal={IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems},\ntitle={Multidomain Inter/Intrachip Silicon Photonic Networks for Energy-Efficient Rack-Scale Computing Systems},\nyear={2020},\nvolume={39},\nnumber={3},\npages={626-639},}"
    }, 
    {
      "type": "Journal",
      "title": "Low-Loss High-Radix Integrated Optical Switch Networks for Software-Defined Servers",
      "author": "Zhifei Wang, Zhehui Wang, Jiang Xu, <I>et.al.</I>;",
      "source": "Journal of Lightwave Technology (JLT), vol. 34, no. 18, pp. 4364-4375, September 2016.",
      "abstract": "Software-defined servers provide high flexibility and customizablility with low power consumption. To satisfy the ultrahigh bandwidth requirement of the interconnection of these servers, integrated optical switch networks, based on the recent development of silicon photonics, are promising candidates. In this study, we present a family of floorplan optimized delta optical networks (FODONs) with the proposed stage switches. Both the analytical approximation and the loss model based on the exhaustive search approach are developed to evaluate the loss parameters in the networks. The optimization of the stage switch radix is conducted as well. Results show that when 32 WDM channels are employed, the worst-case loss of the 1024 × 1024 FODON with 4 × 4 stage switches is only 26 dB, which is 95, 63, 37 dB less than Benes, Fat-tree, and Baseline networks of the same size, respectively. Furthermore, the average loss and the cost of hardware resources of FODONs are much lower than other networks.",
      "bibtex": "@ARTICLE{7546871,\nauthor={Z. Wang and Z. Wang and J. Xu and others},\njournal={Journal of Lightwave Technology}, \ntitle={Low-Loss High-Radix Integrated Optical Switch Networks for Software-Defined Servers}, \nyear={2016},\nvolume={34},\nnumber={18},\npages={4364-4375},}"
    }, 
    {
      "type": "Journal",
      "title": "Coherent and Incoherent Crosstalk Noise Analyses in Interchip/Intrachip Optical Interconnection Networks",
      "author": "Luan H. K. Duong, Zhehui Wang, Mahdi Nikdast, Jiang Xu, <I>et.al.</I>;",
      "source": "IEEE Transactions on Very Large Scale Integration Systems (TVLSI), vol. 24, no. 7, pp. 2475-2487, July 2016.",
      "abstract": "Recently, interchip/intrachip optical interconnection networks have been proposed for ultrahigh-bandwidth and low-latency communications. These networks employ the microresonators (MRs) to modulate, direct, or detect the optical signal. However, utilized MRs suffer from intrinsic crosstalk noise and signal power loss, degrading the network efficiency via the signal-to-noise ratio (SNR). The amount of crosstalk noise and signal power loss may differ from network to network. Hence, there exists a need to systematically analyze the effect of the crosstalk noise and the power loss issues. In this paper, we have developed the analytical models considering both coherent and incoherent crosstalk for both the interchip and intrachip optical networks. The interchip/intrachip optical interconnection networks-the I2CON-are analyzed as a case study. The quantitative results on the individual networks have demonstrated that the architectural design determines the impact of crosstalk on the SNR. We have also demonstrated that the optical interconnection networks with interchip/intrachip interconnects result in better bit error rate (BER) compared with that of only intrachip interconnect. Our analyses of the worst case can be utilized as a platform to compare the realistic performance among different optical interconnection networks via the degradation of SNR/BER and data bandwidth.",
      "bibtex": "@ARTICLE{7390328,\nauthor={L. H. K. Duong and Z. Wang and M. Nikdast and J. Xu and others},\njournal={IEEE Transactions on Very Large Scale Integration (VLSI) Systems},\ntitle={Coherent and Incoherent Crosstalk Noise Analyses in Interchip/Intrachip Optical Interconnection Networks}, \nyear={2016},\nvolume={24},\nnumber={7},\npages={2475-2487},}"
    }, 
    {
      "type": "Journal",
      "title": "System-Level Modeling and Analysis of Thermal Effects in WDM-Based Optical Networks-on-Chip",
      "author": "Yaoyao Ye, Zhehui Wang, Peng Yang, Jiang Xu, <I>et.al.</I>;",
      "source": "IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), vol. 33, no. 11, pp. 1718-1731, November 2014.",
      "abstract": "Multiprocessor systems-on-chip show a trend toward integration of tens and hundreds of processor cores on a single chip. With the development of silicon photonics for short-haul optical communication, wavelength division multiplexing (WDM)-based optical networks-on-chip (ONoCs) are emerging on-chip communication architectures that can potentially offer high bandwidth and power efficiency. Thermal sensitivity of photonic devices is one of the main concerns about the on-chip optical interconnects. We systematically modeled thermal effects in optical links in WDM-based ONoCs. Based on the proposed thermal models, we developed OTemp, an optical thermal effect modeling platform for optical links in both WDM-based ONoCs and single-wavelength ONoCs. OTemp can be used to simulate the power consumption as well as optical power loss for optical links under temperature variations. We use case studies to quantitatively analyze the worst-case power consumption for one wavelength in an eight-wavelength WDM-based optical link under different configurations of low-temperature-dependence techniques. Results show that the worst-case power consumption increases dramatically with on-chip temperature variations. Thermal-based adjustment and optimal device settings can help reduce power consumption under temperature variations. Assume that off-chip vertical-cavity surface-emitting lasers are used as the laser source with WDM channel spacing of 1 nm, if we use thermal-based adjustment with guard rings for channel remapping, the worst-case total power consumption is 6.7 pJ/bit under the maximum temperature variation of 60°C; larger channel spacing would result in a larger worst-case power consumption in this case. If we use thermal-based adjustment without channel remapping, the worst-case total power consumption is around 9.8 pJ/bit under the maximum temperature variation of 60°C; in this case, the worst-case power consumption would benefit from a larger channel spacing.",
      "bibtex": "@ARTICLE{6930846,\nauthor={Y. Ye and Z. Wang and P. Yang and J. Xu and others},\njournal={IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems},\ntitle={System-Level Modeling and Analysis of Thermal Effects in WDM-Based Optical Networks-on-Chip}, \nyear={2014},\nvolume={33},\nnumber={11},\npages={1718-1731},}"
    },
    {
      "type": "Conference",
      "title": "Scalable Low-Power High-Performance Rack-Scale Optical Network",
      "author": "Jun Feng, Zhehui Wang, <I>et.al.</I>;",
      "source": "PHOTONICS in ACM/IEEE Supercomputing Conference (SC), USA, November 2019",
      "abstract": "As large-scale applications are demanding more computation power while Moore's Law is slowing down, rack-scale computing systems are being developed to meet the increasing computation and energy requirements. Optical interconnects have become an alternative to address the performance and energy efficiency issues of rack-scale systems because of their superiority in bandwidth, latency, and power. In this paper, we systematically analyze the rack-scale optical network (RSON) architecture with different path reservation schemes and optical inter-chip networks and the most commonly used architecture for high-performance computing systems. We explore the RSON architecture, floorplan optimized delta optical network (FODON) switch architecture and the preemptive chain feedback (PCF) scheme to optimize multi-domain path reservation. Experimental results show that the RSON with FODON switch and PCF scheme can improve system performance per energy consumption by up to 5x, and around 4x on average, while still maintaining better scalability than state-of-the-art systems.",
      "bibtex": "@INPROCEEDINGS{8950756,\nauthor={J. Feng and Z. Wang and others},\nbooktitle={2019 IEEE/ACM Workshop on Photonics-Optics Technology Oriented Networking, Information and Computing Systems (PHOTONICS)}, \ntitle={Scalable Low-Power High-Performance Rack-Scale Optical Network}, \nyear={2019},\nvolume={},\nnumber={},\npages={1-6},}"
    },
  ]
